-- 12 Sep 2025
include Setting

say 'EXCEPTIONS'
say version
say
say 'Square root of 10 is' SqRt(10)/1
say 'Square root of 0 is' SqRt(0)
say 'Square root of -1 is' SqRt(-1)
exit

include Math
