-- 8 Nov 2025
include Setting

say 'STRING LENGTH'
say version
say
a=''; b='A string'; c='José'; d=1/7
say 'String       Length'
say Left(a,12) Length(a)
say Left(b,12) Length(b)
say Left(c,12) Length(c)
say Left(d,12) Length(d)
exit

include Abend
