-- 8 Nov 2025
include Setting

say 'COPY A STRING'
say version
say
say 'Just assign the string variable to a new one.'
a='This is a string.'
b=a
say a b
c="This is also a string."
d=c
say d c
exit

include Abend
