-- 8 Nov 2025
include Setting

say 'EMPTY STRING'
say version
say
a=''; b='string'
if a='' then
   say 'a is empty'
if length(a)=0 then
   say 'a is empty'
if b<>'' then
   say 'b is not empty'
if \(b='') then
   say 'b is not empty'
if length(b)>0 then
   say 'b is not empty'
exit

include Abend
