-- 24 Aug 2025
include Setting

say 'REAL CONSTANTS AND FUNCTIONS'
say version
say
numeric digits 16
say 'e             =' E()+0
say 'pi            =' Pi()+0
say 'square root 7 =' SqRt(7)+0
say 'log 7 base e  =' Log(7)+0
say 'log 7 base 10 =' Log10(7)+0
say 'log 7 base 2  =' LogXY(7,2)+0
say 'exponential 7 =' Exp(7)+0
say '1/2^3/4       =' Power(1/2,3/4)+0
say 'floor 4/3     =' Floor(4/3)
say 'ceiling 4/3   =' Ceil(4/3)
exit

include Math
